swagger/src/Catalogs/Операции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Операции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>summary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>externalDocs</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>operationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deprecated</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>requestBody</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелоЗапросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>tags</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>tag</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>parameter</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Параметры</v8:Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>responses</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>statusCode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>response</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочныеОбъекты</v8:Type>
								<v8:Type>cfg:CatalogRef.Ответы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>servers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>server</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>security</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>securityRequirement</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТребованияБезопасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>callbacks</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>callback</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбратныеВызовы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/Операции/Ext/ObjectModule.bsl
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.summary) Тогда
		Описание.Вставить("summary", ЭтотОбъект.summary);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.operationId) Тогда
		Описание.Вставить("operationId", ЭтотОбъект.operationId);
	КонецЕсли;
	
	Описание.Вставить("deprecated", ЭтотОбъект.deprecated);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.externalDocs) Тогда
		Описание.Вставить("externalDocs", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.externalDocs));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.requestBody) Тогда
		Описание.Вставить("requestBody", ОбщегоНазначенияSwagger.СформироватьОписаниеОбъектаSwagger(ЭтотОбъект.requestBody));
	КонецЕсли;
	
	Если ЭтотОбъект.responses.Количество() > 0 Тогда
		Описание.Вставить("responses", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "responses", "statusCode", "response"));
	КонецЕсли;
	
	Если ЭтотОбъект.parameters.Количество() > 0 Тогда
		Описание.Вставить("parameters", ОбщегоНазначенияSwagger.СформироватьМассивИзТЧ(ЭтотОбъект, "parameters", "parameter"));
	КонецЕсли;
	
	Если ЭтотОбъект.servers.Количество() > 0 Тогда
		Описание.Вставить("servers", ОбщегоНазначенияSwagger.СформироватьМассивИзТЧ(ЭтотОбъект, "servers", "server"));
	КонецЕсли;
	
	Если ЭтотОбъект.security.Количество() > 0 Тогда
		Описание.Вставить("security", ОбщегоНазначенияSwagger.СформироватьМассивИзТЧ(ЭтотОбъект, "security", "securityRequirement"));
	КонецЕсли;
	
	Если ЭтотОбъект.callbacks.Количество() > 0 Тогда
		Описание.Вставить("callbacks", ОбщегоНазначенияSwagger.СформироватьСоответствиеИзТЧ(ЭтотОбъект, "callbacks", "statusCode", "callback"));
	КонецЕсли;
	
	Если ЭтотОбъект.tags.Количество() > 0 Тогда
		Массив = Новый Массив;
		Для каждого ТекСтрока Из ЭтотОбъект.tags Цикл
			Массив.Добавить(Строка(ТекСтрока.tag));
		КонецЦикла;
		Описание.Вставить("tags", Массив);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
